una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4357_m0.h
/* Interrupt Priority Registers 4-7 */
typedef struct {
  __REG32  IP4            : 8;
  __REG32  IP5            : 8;
  __REG32  IP6            : 8;
  __REG32  IP7            : 8;
} __nvic_ipr1_bits;

/* Interrupt Priority Registers 8-11 */
typedef struct {
  __REG32  IP8           : 8;
  __REG32  IP9           : 8;
  __REG32  IP10          : 8;
  __REG32  IP11          : 8;
} __nvic_ipr2_bits;

/* Interrupt Priority Registers 12-15 */
typedef struct {
  __REG32  IP12          : 8;
  __REG32  IP13          : 8;
  __REG32  IP14          : 8;
  __REG32  IP15          : 8;
} __nvic_ipr3_bits;

/* Interrupt Priority Registers 16-19 */
typedef struct {
  __REG32  IP16          : 8;
  __REG32  IP17          : 8;
  __REG32  IP18          : 8;
  __REG32  IP19          : 8;
} __nvic_ipr4_bits;

/* Interrupt Priority Registers 20-23 */
typedef struct {
  __REG32  IP20          : 8;
  __REG32  IP21          : 8;
  __REG32  IP22          : 8;
  __REG32  IP23          : 8;
} __nvic_ipr5_bits;

/* Interrupt Priority Registers 24-27 */
typedef struct {
  __REG32  IP24          : 8;
  __REG32  IP25          : 8;
  __REG32  IP26          : 8;
  __REG32  IP27          : 8;
} __nvic_ipr6_bits;

/* Interrupt Priority Registers 28-31 */
typedef struct {
  __REG32  IP28          : 8;
  __REG32  IP29          : 8;
  __REG32  IP30          : 8;
  __REG32  IP31          : 8;
} __nvic_ipr7_bits;

/* CPU ID Base Register */
typedef struct {
  __REG32  REVISION       : 4;
  __REG32  PARTNO         :12;
  __REG32  CONSTANT       : 4;
  __REG32  VARIANT        : 4;
  __REG32  IMPLEMENTER    : 8;
} __cpuid_bits;

/* Interrupt Control State Register */
typedef struct {
  __REG32  VECTACTIVE     : 6;
  __REG32                 : 6;
  __REG32  VECTPENDING    : 6;
  __REG32                 : 4;
  __REG32  ISRPENDING     : 1;
  __REG32                 : 2;
  __REG32  PENDSTCLR      : 1;
  __REG32  PENDSTSET      : 1;
  __REG32  PENDSVCLR      : 1;
  __REG32  PENDSVSET      : 1;
  __REG32                 : 2;
  __REG32  NMIPENDSET     : 1;
} __icsr_bits;

/* Application Interrupt and Reset Control Register */
typedef struct {
  __REG32                 : 1;
  __REG32  VECTCLRACTIVE  : 1;
  __REG32  SYSRESETREQ    : 1;
  __REG32                 :12;
  __REG32  ENDIANESS      : 1;
  __REG32  VECTKEY        :16;
} __aircr_bits;

/* System Control Register */
typedef struct {
  __REG32                 : 1;
  __REG32  SLEEPONEXIT    : 1;
  __REG32  SLEEPDEEP      : 1;
  __REG32                 : 1;
  __REG32  SEVONPEND      : 1;
  __REG32                 :27;
} __scr_bits;

/* Configuration Control Register */
typedef struct {
  __REG32                 : 3;
  __REG32  UNALIGN_TRP    : 1;
  __REG32                 : 5;
  __REG32  STKALIGN       : 1;
  __REG32                 :22;
} __ccr_bits;

/* Level configuration register */
typedef struct {
  __REG32  WAKEUP0_L      : 1;
  __REG32  WAKEUP1_L      : 1;
  __REG32  WAKEUP2_L      : 1;
  __REG32  WAKEUP3_L      : 1;
  __REG32  ATIMER_L       : 1;
  __REG32  RTC_L          : 1;
  __REG32  BOD_L          : 1;
  __REG32  WWDT_L         : 1;
  __REG32  ETH_L          : 1;
  __REG32  USB0_L         : 1;
  __REG32  USB1_L         : 1;
  __REG32  SDMMC_L        : 1;
  __REG32  CAN_L          : 1;
  __REG32  TIM2_L         : 1;
  __REG32  TIM6_L         : 1;
  __REG32  QEI_L          : 1;
  __REG32  TIM14_L        : 1;
  __REG32                 : 2;
  __REG32  RESET_L        : 1;
  __REG32                 :12;
} __er_hilo_bits;

/* Edge configuration register */
typedef struct {
  __REG32  WAKEUP0_E      : 1;
  __REG32  WAKEUP1_E      : 1;
  __REG32  WAKEUP2_E      : 1;
  __REG32  WAKEUP3_E      : 1;
  __REG32  ATIMER_E       : 1;
  __REG32  RTC_E          : 1;
  __REG32  BOD_E          : 1;
  __REG32  WWDT_E         : 1;
  __REG32  ETH_E          : 1;
  __REG32  USB0_E         : 1;
  __REG32  USB1_E         : 1;
  __REG32  SDMMC_E        : 1;
  __REG32  CAN_E          : 1;
  __REG32  TIM2_E         : 1;
  __REG32  TIM6_E         : 1;
  __REG32  QEI_E          : 1;
  __REG32  TIM14_E        : 1;
  __REG32                 : 2;
  __REG32  RESET_E        : 1;
  __REG32                 :12;
} __er_edge_bits;

/* Interrupt clear enable register */

#define ER_CLR_EN_WAKEUP0_CLREN     (0x00000001UL)
#define ER_CLR_EN_WAKEUP1_CLREN     (0x00000002UL)
#define ER_CLR_EN_WAKEUP2_CLREN     (0x00000004UL)
#define ER_CLR_EN_WAKEUP3_CLREN     (0x00000008UL)
#define ER_CLR_EN_ATIMER_CLREN      (0x00000010UL)
#define ER_CLR_EN_RTC_CLREN         (0x00000020UL)
#define ER_CLR_EN_BOD_CLREN         (0x00000040UL)
#define ER_CLR_EN_WWDT_CLREN        (0x00000080UL)
#define ER_CLR_EN_ETH_CLREN         (0x00000100UL)
#define ER_CLR_EN_USB0_CLREN        (0x00000200UL)
#define ER_CLR_EN_USB1_CLREN        (0x00000400UL)
#define ER_CLR_EN_SDMMC_CLREN       (0x00000800UL)
#define ER_CLR_EN_CAN_CLREN         (0x00001000UL)
#define ER_CLR_EN_TIM2_CLREN        (0x00002000UL)
#define ER_CLR_EN_TIM6_CLREN        (0x00004000UL)
#define ER_CLR_EN_QEI_CLREN         (0x00008000UL)
#define ER_CLR_EN_TIM14_CLREN       (0x00010000UL)
#define ER_CLR_EN_RESET_CLREN       (0x00080000UL)

/* Interrupt set enable register */

#define ER_SET_EN_WAKEUP0_SETEN     (0x00000001UL)
#define ER_SET_EN_WAKEUP1_SETEN     (0x00000002UL)
#define ER_SET_EN_WAKEUP2_SETEN     (0x00000004UL)
#define ER_SET_EN_WAKEUP3_SETEN     (0x00000008UL)
#define ER_SET_EN_ATIMER_SETEN      (0x00000010UL)
#define ER_SET_EN_RTC_SETEN         (0x00000020UL)
#define ER_SET_EN_BOD_SETEN         (0x00000040UL)
#define ER_SET_EN_WWDT_SETEN        (0x00000080UL)
#define ER_SET_EN_ETH_SETEN         (0x00000100UL)
#define ER_SET_EN_USB0_SETEN        (0x00000200UL)
#define ER_SET_EN_USB1_SETEN        (0x00000400UL)
#define ER_SET_EN_SDMMC_SETEN       (0x00000800UL)
#define ER_SET_EN_CAN_SETEN         (0x00001000UL)
#define ER_SET_EN_TIM2_SETEN        (0x00002000UL)
#define ER_SET_EN_TIM6_SETEN        (0x00004000UL)
#define ER_SET_EN_QEI_SETEN         (0x00008000UL)
#define ER_SET_EN_TIM14_SETEN       (0x00010000UL)
#define ER_SET_EN_RESET_SETEN       (0x00080000UL)

/* Interrupt status register */
typedef struct {
  __REG32  WAKEUP0_ST     : 1;
  __REG32  WAKEUP1_ST     : 1;
  __REG32  WAKEUP2_ST     : 1;
  __REG32  WAKEUP3_ST     : 1;
  __REG32  ATIMER_ST      : 1;
  __REG32  RTC_ST         : 1;
  __REG32  BOD_ST         : 1;
  __REG32  WWDT_ST        : 1;
  __REG32  ETH_ST         : 1;
  __REG32  USB0_ST        : 1;
  __REG32  USB1_ST        : 1;
  __REG32  SDMMC_ST       : 1;
  __REG32  CAN_ST         : 1;
  __REG32  TIM2_ST        : 1;
  __REG32  TIM6_ST        : 1;
  __REG32  QEI_ST         : 1;
  __REG32  TIM14_ST       : 1;
  __REG32                 : 2;
  __REG32  RESET_ST       : 1;
  __REG32                 :12;
} __er_status_bits;

/* Event enable register */
typedef struct {
  __REG32  WAKEUP0_EN     : 1;
  __REG32  WAKEUP1_EN     : 1;
  __REG32  WAKEUP2_EN     : 1;
  __REG32  WAKEUP3_EN     : 1;
  __REG32  ATIMER_EN      : 1;
  __REG32  RTC_EN         : 1;
  __REG32  BOD_EN         : 1;
  __REG32  WWDT_EN        : 1;
  __REG32  ETH_EN         : 1;
  __REG32  USB0_EN        : 1;
  __REG32  USB1_EN        : 1;
  __REG32  SDMMC_EN       : 1;
  __REG32  CAN_EN         : 1;
  __REG32  TIM2_EN        : 1;
  __REG32  TIM6_EN        : 1;
  __REG32  QEI_EN         : 1;
  __REG32  TIM14_EN       : 1;
  __REG32                 : 2;
  __REG32  RESET_EN       : 1;
  __REG32                 :12;
} __er_enable_bits;

/* Interrupt clear status register */

#define ER_CLR_STAT_WAKEUP0_CLRST     (0x00000001UL)
#define ER_CLR_STAT_WAKEUP1_CLRST     (0x00000002UL)
#define ER_CLR_STAT_WAKEUP2_CLRST     (0x00000004UL)
#define ER_CLR_STAT_WAKEUP3_CLRST     (0x00000008UL)
#define ER_CLR_STAT_ATIMER_CLRST      (0x00000010UL)
#define ER_CLR_STAT_RTC_CLRST         (0x00000020UL)
#define ER_CLR_STAT_BOD_CLRST         (0x00000040UL)
#define ER_CLR_STAT_WWDT_CLRST        (0x00000080UL)
#define ER_CLR_STAT_ETH_CLRST         (0x00000100UL)
#define ER_CLR_STAT_USB0_CLRST        (0x00000200UL)
#define ER_CLR_STAT_USB1_CLRST        (0x00000400UL)
#define ER_CLR_STAT_SDMMC_CLRST       (0x00000800UL)
#define ER_CLR_STAT_CAN_CLRST         (0x00001000UL)
#define ER_CLR_STAT_TIM2_CLRST        (0x00002000UL)
#define ER_CLR_STAT_TIM6_CLRST        (0x00004000UL)
#define ER_CLR_STAT_QEI_CLRST         (0x00008000UL)
#define ER_CLR_STAT_TIM14_CLRST       (0x00010000UL)
#define ER_CLR_STAT_RESET_CLRST       (0x00080000UL)

/* Interrupt set status register */

#define ER_SET_STAT_WAKEUP0_SETST     (0x00000001UL)
#define ER_SET_STAT_WAKEUP1_SETST     (0x00000002UL)
#define ER_SET_STAT_WAKEUP2_SETST     (0x00000004UL)
#define ER_SET_STAT_WAKEUP3_SETST     (0x00000008UL)
#define ER_SET_STAT_ATIMER_SETST      (0x00000010UL)
#define ER_SET_STAT_RTC_SETST         (0x00000020UL)
#define ER_SET_STAT_BOD_SETST         (0x00000040UL)
#define ER_SET_STAT_WWDT_SETST        (0x00000080UL)
#define ER_SET_STAT_ETH_SETST         (0x00000100UL)
#define ER_SET_STAT_USB0_SETST        (0x00000200UL)
#define ER_SET_STAT_USB1_SETST        (0x00000400UL)
#define ER_SET_STAT_SDMMC_SETST       (0x00000800UL)
#define ER_SET_STAT_CAN_SETST         (0x00001000UL)
#define ER_SET_STAT_TIM2_SETST        (0x00002000UL)
#define ER_SET_STAT_TIM6_SETST        (0x00004000UL)
#define ER_SET_STAT_QEI_SETST         (0x00008000UL)
#define ER_SET_STAT_TIM14_SETST       (0x00010000UL)
#define ER_SET_STAT_RESET_SETST       (0x00080000UL)

/* MPU Type register */
typedef struct {
  __REG32  SEPARATE       : 1;
  __REG32                 : 7;
  __REG32  DREGION        : 8;
  __REG32  IREGION        : 8;
  __REG32                 : 8;
} __mpu_type_bits;

