una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4357_m0.h
/* Shift clock interrupt clear mask register */

#define SGPIO_CLR_EN_0_CLR_SCI    (0x0000FFFFUL)
#define SGPIO_CLR_EN_0_CLR_SCI0   (0x00000001UL)
#define SGPIO_CLR_EN_0_CLR_SCI1   (0x00000002UL)
#define SGPIO_CLR_EN_0_CLR_SCI2   (0x00000004UL)
#define SGPIO_CLR_EN_0_CLR_SCI3   (0x00000008UL)
#define SGPIO_CLR_EN_0_CLR_SCI4   (0x00000010UL)
#define SGPIO_CLR_EN_0_CLR_SCI5   (0x00000020UL)
#define SGPIO_CLR_EN_0_CLR_SCI6   (0x00000040UL)
#define SGPIO_CLR_EN_0_CLR_SCI7   (0x00000080UL)
#define SGPIO_CLR_EN_0_CLR_SCI8   (0x00000100UL)
#define SGPIO_CLR_EN_0_CLR_SCI9   (0x00000200UL)
#define SGPIO_CLR_EN_0_CLR_SCI10  (0x00000400UL)
#define SGPIO_CLR_EN_0_CLR_SCI11  (0x00000800UL)
#define SGPIO_CLR_EN_0_CLR_SCI12  (0x00001000UL)
#define SGPIO_CLR_EN_0_CLR_SCI13  (0x00002000UL)
#define SGPIO_CLR_EN_0_CLR_SCI14  (0x00004000UL)
#define SGPIO_CLR_EN_0_CLR_SCI15  (0x00008000UL)

/* Shift clock interrupt set mask register */
#define SGPIO_SET_EN_0_SET_SCI    (0x0000FFFFUL)
#define SGPIO_SET_EN_0_SET_SCI0   (0x00000001UL)
#define SGPIO_SET_EN_0_SET_SCI1   (0x00000002UL)
#define SGPIO_SET_EN_0_SET_SCI2   (0x00000004UL)
#define SGPIO_SET_EN_0_SET_SCI3   (0x00000008UL)
#define SGPIO_SET_EN_0_SET_SCI4   (0x00000010UL)
#define SGPIO_SET_EN_0_SET_SCI5   (0x00000020UL)
#define SGPIO_SET_EN_0_SET_SCI6   (0x00000040UL)
#define SGPIO_SET_EN_0_SET_SCI7   (0x00000080UL)
#define SGPIO_SET_EN_0_SET_SCI8   (0x00000100UL)
#define SGPIO_SET_EN_0_SET_SCI9   (0x00000200UL)
#define SGPIO_SET_EN_0_SET_SCI10  (0x00000400UL)
#define SGPIO_SET_EN_0_SET_SCI11  (0x00000800UL)
#define SGPIO_SET_EN_0_SET_SCI12  (0x00001000UL)
#define SGPIO_SET_EN_0_SET_SCI13  (0x00002000UL)
#define SGPIO_SET_EN_0_SET_SCI14  (0x00004000UL)
#define SGPIO_SET_EN_0_SET_SCI15  (0x00008000UL)

/* Shift clock interrupt enable register */
typedef struct {
  __REG32  ENABLE_SCI0           : 1;
  __REG32  ENABLE_SCI1           : 1;
  __REG32  ENABLE_SCI2           : 1;
  __REG32  ENABLE_SCI3           : 1;
  __REG32  ENABLE_SCI4           : 1;
  __REG32  ENABLE_SCI5           : 1;
  __REG32  ENABLE_SCI6           : 1;
  __REG32  ENABLE_SCI7           : 1;
  __REG32  ENABLE_SCI8           : 1;
  __REG32  ENABLE_SCI9           : 1;
  __REG32  ENABLE_SCI10          : 1;
  __REG32  ENABLE_SCI11          : 1;
  __REG32  ENABLE_SCI12          : 1;
  __REG32  ENABLE_SCI13          : 1;
  __REG32  ENABLE_SCI14          : 1;
  __REG32  ENABLE_SCI15          : 1;
  __REG32                        :16;
} __sgpio_enable_0_bits;

/* Shift clock interrupt status register */
typedef struct {
  __REG32  STATUS_SCI0           : 1;
  __REG32  STATUS_SCI1           : 1;
  __REG32  STATUS_SCI2           : 1;
  __REG32  STATUS_SCI3           : 1;
  __REG32  STATUS_SCI4           : 1;
  __REG32  STATUS_SCI5           : 1;
  __REG32  STATUS_SCI6           : 1;
  __REG32  STATUS_SCI7           : 1;
  __REG32  STATUS_SCI8           : 1;
  __REG32  STATUS_SCI9           : 1;
  __REG32  STATUS_SCI10          : 1;
  __REG32  STATUS_SCI11          : 1;
  __REG32  STATUS_SCI12          : 1;
  __REG32  STATUS_SCI13          : 1;
  __REG32  STATUS_SCI14          : 1;
  __REG32  STATUS_SCI15          : 1;
  __REG32                        :16;
} __sgpio_status_0_bits;

/* Shift clock interrupt clear status register */

#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI    (0x0000FFFFUL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI0   (0x00000001UL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI1   (0x00000002UL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI2   (0x00000004UL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI3   (0x00000008UL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI4   (0x00000010UL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI5   (0x00000020UL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI6   (0x00000040UL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI7   (0x00000080UL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI8   (0x00000100UL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI9   (0x00000200UL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI10  (0x00000400UL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI11  (0x00000800UL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI12  (0x00001000UL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI13  (0x00002000UL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI14  (0x00004000UL)
#define SGPIO_CTR_STATUS_0_CTR_STATUS_SCI15  (0x00008000UL)

/* Shift clock interrupt set status register */

#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI    (0x0000FFFFUL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI0   (0x00000001UL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI1   (0x00000002UL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI2   (0x00000004UL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI3   (0x00000008UL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI4   (0x00000010UL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI5   (0x00000020UL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI6   (0x00000040UL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI7   (0x00000080UL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI8   (0x00000100UL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI9   (0x00000200UL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI10  (0x00000400UL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI11  (0x00000800UL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI12  (0x00001000UL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI13  (0x00002000UL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI14  (0x00004000UL)
#define SGPIO_SET_STATUS_0_CTR_STATUS_SCI15  (0x00008000UL)

/* Capture clock interrupt clear mask register */

#define SGPIO_CLR_EN_1_CLR_CCI    (0x0000FFFFUL)
#define SGPIO_CLR_EN_1_CLR_CCI0   (0x00000001UL)
#define SGPIO_CLR_EN_1_CLR_CCI1   (0x00000002UL)
#define SGPIO_CLR_EN_1_CLR_CCI2   (0x00000004UL)
#define SGPIO_CLR_EN_1_CLR_CCI3   (0x00000008UL)
#define SGPIO_CLR_EN_1_CLR_CCI4   (0x00000010UL)
#define SGPIO_CLR_EN_1_CLR_CCI5   (0x00000020UL)
#define SGPIO_CLR_EN_1_CLR_CCI6   (0x00000040UL)
#define SGPIO_CLR_EN_1_CLR_CCI7   (0x00000080UL)
#define SGPIO_CLR_EN_1_CLR_CCI8   (0x00000100UL)
#define SGPIO_CLR_EN_1_CLR_CCI9   (0x00000200UL)
#define SGPIO_CLR_EN_1_CLR_CCI10  (0x00000400UL)
#define SGPIO_CLR_EN_1_CLR_CCI11  (0x00000800UL)
#define SGPIO_CLR_EN_1_CLR_CCI12  (0x00001000UL)
#define SGPIO_CLR_EN_1_CLR_CCI13  (0x00002000UL)
#define SGPIO_CLR_EN_1_CLR_CCI14  (0x00004000UL)
#define SGPIO_CLR_EN_1_CLR_CCI15  (0x00008000UL)

/* Capture clock interrupt set mask register */

#define SGPIO_SET_EN_1_SET_CCI    (0x0000FFFFUL)
#define SGPIO_SET_EN_1_SET_CCI0   (0x00000001UL)
#define SGPIO_SET_EN_1_SET_CCI1   (0x00000002UL)
#define SGPIO_SET_EN_1_SET_CCI2   (0x00000004UL)
#define SGPIO_SET_EN_1_SET_CCI3   (0x00000008UL)
#define SGPIO_SET_EN_1_SET_CCI4   (0x00000010UL)
#define SGPIO_SET_EN_1_SET_CCI5   (0x00000020UL)
#define SGPIO_SET_EN_1_SET_CCI6   (0x00000040UL)
#define SGPIO_SET_EN_1_SET_CCI7   (0x00000080UL)
#define SGPIO_SET_EN_1_SET_CCI8   (0x00000100UL)
#define SGPIO_SET_EN_1_SET_CCI9   (0x00000200UL)
#define SGPIO_SET_EN_1_SET_CCI10  (0x00000400UL)
#define SGPIO_SET_EN_1_SET_CCI11  (0x00000800UL)
#define SGPIO_SET_EN_1_SET_CCI12  (0x00001000UL)
#define SGPIO_SET_EN_1_SET_CCI13  (0x00002000UL)
#define SGPIO_SET_EN_1_SET_CCI14  (0x00004000UL)
#define SGPIO_SET_EN_1_SET_CCI15  (0x00008000UL)

/* Capture clock interrupt enable register */
typedef struct {
  __REG32  ENABLE_CCI0           : 1;
  __REG32  ENABLE_CCI1           : 1;
  __REG32  ENABLE_CCI2           : 1;
  __REG32  ENABLE_CCI3           : 1;
  __REG32  ENABLE_CCI4           : 1;
  __REG32  ENABLE_CCI5           : 1;
  __REG32  ENABLE_CCI6           : 1;
  __REG32  ENABLE_CCI7           : 1;
  __REG32  ENABLE_CCI8           : 1;
  __REG32  ENABLE_CCI9           : 1;
  __REG32  ENABLE_CCI10          : 1;
  __REG32  ENABLE_CCI11          : 1;
  __REG32  ENABLE_CCI12          : 1;
  __REG32  ENABLE_CCI13          : 1;
  __REG32  ENABLE_CCI14          : 1;
  __REG32  ENABLE_CCI15          : 1;
  __REG32                        :16;
} __sgpio_enable_1_bits;

/* Capture clock interrupt status register */
typedef struct {
  __REG32  STATUS_CCI0           : 1;
  __REG32  STATUS_CCI1           : 1;
  __REG32  STATUS_CCI2           : 1;
  __REG32  STATUS_CCI3           : 1;
  __REG32  STATUS_CCI4           : 1;
  __REG32  STATUS_CCI5           : 1;
  __REG32  STATUS_CCI6           : 1;
  __REG32  STATUS_CCI7           : 1;
  __REG32  STATUS_CCI8           : 1;
  __REG32  STATUS_CCI9           : 1;
  __REG32  STATUS_CCI10          : 1;
  __REG32  STATUS_CCI11          : 1;
  __REG32  STATUS_CCI12          : 1;
  __REG32  STATUS_CCI13          : 1;
  __REG32  STATUS_CCI14          : 1;
  __REG32  STATUS_CCI15          : 1;
  __REG32                        :16;
} __sgpio_status_1_bits;

/* Capture clock interrupt clear status register */

