una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4357_m0.h
/* USB HCSPARAMS register */
typedef struct{
__REG32 N_PORTS         : 4;
__REG32 PPC             : 1;
__REG32                 : 3;
__REG32 N_PCC           : 4;
__REG32 N_CC            : 4;
__REG32 PI              : 1;
__REG32                 : 3;
__REG32 N_PTT           : 4;
__REG32 N_TT            : 4;
__REG32                 : 4;
} __usb_hcsparams_reg_bits;

/* USB HCCPARAMS register */
typedef struct{
__REG32 ADC             : 1;
__REG32 PFL             : 1;
__REG32 ASP             : 1;
__REG32                 : 1;
__REG32 IST             : 4;
__REG32 EECP            : 8;
__REG32                 :16;
} __usb_hccparams_reg_bits;

/* USB DCIVERSION register */
typedef struct{
__REG32 DCIVERSION      :16;
__REG32                 :16;
} __usb_dciversion_reg_bits;

/* USB DCCPARAMS */
typedef struct{
__REG32 DEN             : 5;
__REG32                 : 2;
__REG32 DC              : 1;
__REG32 HC              : 1;
__REG32                 :23;
} __usb_dccparams_reg_bits;

/* USB Command register */
typedef struct{
__REG32 RS              : 1;
__REG32 RST             : 1;
__REG32 FS0             : 1;
__REG32 FS1             : 1;
__REG32 PSE             : 1;
__REG32 ASE             : 1;
__REG32 IAA             : 1;
__REG32                 : 1;
__REG32 ASP1_0          : 2;
__REG32                 : 1;
__REG32 ASPE            : 1;
__REG32                 : 1;
__REG32 SUTW            : 1;
__REG32 ATDTW           : 1;
__REG32 FS2             : 1;
__REG32 ITC             : 8;
__REG32                 : 8;
} __usb_usbcmd_reg_bits;

/* USB Status register */
typedef struct{
__REG32 UI              : 1;
__REG32 UEI             : 1;
__REG32 PCI             : 1;
__REG32 FRI             : 1;
__REG32                 : 1;
__REG32 AAI             : 1;
__REG32 URI             : 1;
__REG32 SRI             : 1;
__REG32 SLI             : 1;
__REG32                 : 3;
__REG32 HCH             : 1;
__REG32 RCL             : 1;
__REG32 PS              : 1;
__REG32 AS              : 1;
__REG32 NAKI            : 1;
__REG32                 : 1;
__REG32 UAI             : 1;
__REG32 UPI             : 1;
__REG32                 :12;
} __usb_usbsts_reg_bits;

/* USB Interrupt register */
typedef struct{
__REG32 UE              : 1;
__REG32 UEE             : 1;
__REG32 PCE             : 1;
__REG32 FRE             : 1;
__REG32                 : 1;
__REG32 AAE             : 1;
__REG32 URE             : 1;
__REG32 SRE             : 1;
__REG32 SLE             : 1;
__REG32                 : 7;
__REG32 NAKE            : 1;
__REG32                 : 1;
__REG32 UAIE            : 1;
__REG32 UPIA            : 1;
__REG32                 :12;
} __usb_usbintr_reg_bits;

/* USB Frame index register */
typedef struct{
__REG32 FRINDEX2_0     : 3;
__REG32 FRINDEX12_3     :10;
__REG32                 :19;
} __usb_frindex_bits;

/* USB_PERIODICLISTBASE_DEVICEADDR_REG */
typedef union{
  /* USB0_PERIODICLISTBASE */
  /* USB1_PERIODICLISTBASE */
  struct{
  __REG32                 :12;
  __REG32 PERBASE31_12    :20;
  };
  /* USB0_DEVICEADDR */
  /* USB1_DEVICEADDR */
  struct{
  __REG32                 :24;
  __REG32 USBADRA         : 1;
  __REG32 USBADR          : 7;
  };
} __usb_periodiclistbase_reg_bits;

/* USB_ASYNCLISTADDR_ENDPOINTLISTADDR_REG */
typedef union{
  /* USB0_ASYNCLISTADDR */
  /* USB1_ASYNCLISTADDR */
  struct{
  __REG32                 : 5;
  __REG32 ASYBASE31_5     :27;
  };
  /* USB0_ENDPOINTLISTADDR */
  /* USB1_ENDPOINTLISTADDR */
  struct{
  __REG32                 :11;
  __REG32 EPBASE31_11     :21;
  };
} __usb_asynclistaddr_reg_bits;

/* TT Control register (TTCTRL) */
typedef struct{
__REG32                 :24;
__REG32 TTHA            : 7;
__REG32                 : 1;
} __usb_ttctrl_reg_bits;

/* Burst Size register (BURSTSIZE) */
typedef struct{
__REG32 RXPBURST        : 8;
__REG32 TXPBURST        : 8;
__REG32                 :16;
} __usb_burstsize_reg_bits;

/* Transfer buffer Fill Tuning register (TXFILLTUNING)*/
typedef struct{
__REG32 TXSCHOH         : 8;
__REG32 TXSCHEATLTH     : 5;
__REG32                 : 3;
__REG32 TXFIFOTHRES     : 6;
__REG32                 :10;
} __usb_txfilltuning_reg_bits;

/* USB ULPI viewport register */
typedef struct{
__REG32 ULPIDATWR       : 8;
__REG32 ULPIDATRD       : 8;
__REG32 ULPIADDR        : 8;
__REG32 ULPIPORT        : 3;
__REG32 ULPISS          : 1;
__REG32                 : 1;
__REG32 ULPIRW          : 1;
__REG32 ULPIRUN         : 1;
__REG32 ULPIWU          : 1;
} __usb1_ulpiviewport_reg_bits;

/* BINTERVAL register */
typedef struct{
__REG32 BINT            : 4;
__REG32                 :28;
} __usb_binterval_reg_bits;

/* USB Endpoint NAK register (ENDPTNAK) */
typedef union{
  struct{
  __REG32 EP0RN           : 1;
  __REG32 EP1RN           : 1;
  __REG32 EP2RN           : 1;
  __REG32 EP3RN           : 1;
  __REG32 EP4RN           : 1;
  __REG32 EP5RN           : 1;
  __REG32                 :10;
  __REG32 EP0TN           : 1;
  __REG32 EP1TN           : 1;
  __REG32 EP2TN           : 1;
  __REG32 EP3TN           : 1;
  __REG32 EP4TN           : 1;
  __REG32 EP5TN           : 1;
  __REG32                 :10;
  };
  /* USB0_ENDPTNAK */
  struct{
  __REG32 EPRN0           : 1;
  __REG32 EPRN1           : 1;
  __REG32 EPRN2           : 1;
  __REG32 EPRN3           : 1;
  __REG32 EPRN4           : 1;
  __REG32 EPRN5           : 1;
  __REG32                 :10;
  __REG32 EPTN0           : 1;
  __REG32 EPTN1           : 1;
  __REG32 EPTN2           : 1;
  __REG32 EPTN3           : 1;
  __REG32 EPTN4           : 1;
  __REG32 EPTN5           : 1;
  __REG32                 :10;
  };
} __usb_endptnak_reg_bits;

/* USB1 Endpoint NAK register (ENDPTNAK) */
typedef union {
  struct{
  __REG32 EP0RN           : 1;
  __REG32 EP1RN           : 1;
  __REG32 EP2RN           : 1;
  __REG32 EP3RN           : 1;
  __REG32                 :12;
  __REG32 EP0TN           : 1;
  __REG32 EP1TN           : 1;
  __REG32 EP2TN           : 1;
  __REG32 EP3TN           : 1;
  __REG32                 :12;
  };
  /* USB1_ENDPTNAK */
  struct{
  __REG32 EPRN0           : 1;
  __REG32 EPRN1           : 1;
  __REG32 EPRN2           : 1;
  __REG32 EPRN3           : 1;
  __REG32                 :12;
  __REG32 EPTN0           : 1;
  __REG32 EPTN1           : 1;
  __REG32 EPTN2           : 1;
  __REG32 EPTN3           : 1;
  __REG32                 :12;
  };
} __usb1_endptnak_reg_bits;

/* USB Endpoint NAK Enable register (ENDPTNAKEN) */
typedef union {
  struct{
  __REG32 EP0RNE          : 1;
  __REG32 EP1RNE          : 1;
  __REG32 EP2RNE          : 1;
  __REG32 EP3RNE          : 1;
  __REG32 EP4RNE          : 1;
  __REG32 EP5RNE          : 1;
  __REG32                 :10;
  __REG32 EP0TNE          : 1;
  __REG32 EP1TNE          : 1;
  __REG32 EP2TNE          : 1;
  __REG32 EP3TNE          : 1;
  __REG32 EP4TNE          : 1;
  __REG32 EP5TNE          : 1;
  __REG32                 :10;
  };
  /* USB0_ENDPTNAKEN */
  struct{
  __REG32 EPRNE0          : 1;
  __REG32 EPRNE1          : 1;
  __REG32 EPRNE2          : 1;
  __REG32 EPRNE3          : 1;
  __REG32 EPRNE4          : 1;
  __REG32 EPRNE5          : 1;
  __REG32                 :10;
  __REG32 EPTNE0          : 1;
  __REG32 EPTNE1          : 1;
  __REG32 EPTNE2          : 1;
  __REG32 EPTNE3          : 1;
  __REG32 EPTNE4          : 1;
  __REG32 EPTNE5          : 1;
  __REG32                 :10;
  };
} __usb_endptnaken_reg_bits;

/* USB Endpoint NAK Enable register (ENDPTNAKEN) */
typedef union {
  struct{
  __REG32 EP0RNE          : 1;
  __REG32 EP1RNE          : 1;
  __REG32 EP2RNE          : 1;
  __REG32 EP3RNE          : 1;
  __REG32                 :12;
  __REG32 EP0TNE          : 1;
  __REG32 EP1TNE          : 1;
  __REG32 EP2TNE          : 1;
  __REG32 EP3TNE          : 1;
  __REG32                 :12;
  };
  /* USB1_ENDPTNAKEN */
  struct{
  __REG32 EPRNE0          : 1;
  __REG32 EPRNE1          : 1;
  __REG32 EPRNE2          : 1;
  __REG32 EPRNE3          : 1;
  __REG32                 :12;
  __REG32 EPTNE0          : 1;
  __REG32 EPTNE1          : 1;
  __REG32 EPTNE2          : 1;
  __REG32 EPTNE3          : 1;
  __REG32                 :12;
  };
} __usb1_endptnaken_reg_bits;

