una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4357_m0.h
/* DMA Operation mode register */
typedef struct{
__REG32                 : 1;
__REG32 SR              : 1;
__REG32 OSF             : 1;
__REG32 RTC             : 2;
__REG32                 : 1;
__REG32 FUF             : 1;
__REG32 FEF             : 1;
__REG32                 : 5;
__REG32 ST              : 1;
__REG32 TTC             : 3;
__REG32                 : 3;
__REG32 FTF             : 1;
__REG32 TSF             : 1;
__REG32                 : 2;
__REG32 DFF             : 1;
__REG32 RSF             : 1;
__REG32 DT              : 1;
__REG32                 : 5;
} __eth_dma_op_mode_bits;

/* DMA Interrupt enable register */
typedef struct{
__REG32 TIE             : 1;
__REG32 TSE             : 1;
__REG32 TUE             : 1;
__REG32 TJE             : 1;
__REG32 OVE             : 1;
__REG32 UNE             : 1;
__REG32 RIE             : 1;
__REG32 RUE             : 1;
__REG32 RSE             : 1;
__REG32 RWE             : 1;
__REG32 ETE             : 1;
__REG32                 : 2;
__REG32 FBE             : 1;
__REG32 ERE             : 1;
__REG32 AIE             : 1;
__REG32 NIE             : 1;
__REG32                 :15;
} __eth_dma_int_en_bits;

/* DMA Missed frame and buffer overflow counter register */
typedef struct{
__REG32 FMC             :16;
__REG32 OC              : 1;
__REG32 FMA             :11;
__REG32 OF              : 1;
__REG32                 : 3;
} __eth_dma_mfrm_bufof_bits;

/* DMA Receive interrupt watchdog timer register */
typedef struct{
__REG32 RIWT            : 8;
__REG32                 :24;
} __eth_dma_rec_int_wdt_bits;


/* Horizontal Timing register */
typedef struct{
__REG32                 : 2;
__REG32 PPL             : 6;
__REG32 HSW             : 8;
__REG32 HFP             : 8;
__REG32 HBP             : 8;
}__lcd_timh_bits;

/* Vertical Timing register */
typedef struct{
__REG32 LPP             :10;
__REG32 VSW             : 6;
__REG32 VFP             : 8;
__REG32 VBP             : 8;
}__lcd_timv_bits;

/* Clock and Signal Polarity register */
typedef struct{
__REG32 PCD_LO          : 5;
__REG32 CLKSEL          : 1;
__REG32 ACB             : 5;
__REG32 IVS             : 1;
__REG32 IHS             : 1;
__REG32 IPC             : 1;
__REG32 IOE             : 1;
__REG32                 : 1;
__REG32 CPL             :10;
__REG32 BCD             : 1;
__REG32 PCD_HI          : 5;
}__lcd_pol_bits;

/* Line End Control register */
typedef struct{
__REG32 LED             : 7;
__REG32                 : 9;
__REG32 LEE             : 1;
__REG32                 :15;
}__lcd_le_bits;

/* Upper Panel Frame Base register */
typedef struct{
__REG32                 : 3;
__REG32 LCDUPBASE       :29;
}__lcd_upbase_bits;

/* Lower Panel Frame Base register */
typedef struct{
__REG32                 : 3;
__REG32 LCDLPBASE       :29;
}__lcd_lpbase_bits;

/* LCD Control register */
typedef struct{
__REG32 LCDEN           : 1;
__REG32 LCDBPP          : 3;
__REG32 LCDBW           : 1;
__REG32 LCDTFT          : 1;
__REG32 LCDMONO8        : 1;
__REG32 LCDDUAL         : 1;
__REG32 BGR             : 1;
__REG32 BEBO            : 1;
__REG32 BEPO            : 1;
__REG32 LCDPWR          : 1;
__REG32 LCDVCOMP        : 2;
__REG32                 : 2;
__REG32 WATERMARK       : 1;
__REG32                 :15;
}__lcd_ctrl_bits;

/* Interrupt Mask register */
typedef struct{
__REG32                 : 1;
__REG32 FUFIM           : 1;
__REG32 LNBUIM          : 1;
__REG32 VCOMPIM         : 1;
__REG32 BERIM           : 1;
__REG32                 :27;
}__lcd_intmsk_bits;

/* Raw Interrupt Status register */
typedef struct{
__REG32                 : 1;
__REG32 FUFRIS          : 1;
__REG32 LNBURIS         : 1;
__REG32 VCOMPRIS        : 1;
__REG32 BERRAW          : 1;
__REG32                 :27;
}__lcd_intraw_bits;

/* Masked Interrupt Status register */
typedef struct{
__REG32                 : 1;
__REG32 FUFMIS          : 1;
__REG32 LNBUMIS         : 1;
__REG32 VCOMPMIS        : 1;
__REG32 BERMIS          : 1;
__REG32                 :27;
}__lcd_intstat_bits;

/* Interrupt Clear register */

#define LCD_INTCLR_FUFIC    (0x00000002UL)
#define LCD_INTCLR_LNBUIC   (0x00000004UL)
#define LCD_INTCLR_VCOMPIC  (0x00000008UL)
#define LCD_INTCLR_BERIC    (0x00000010UL)

/* Color Palette register */
typedef struct{
__REG32 R04_0           : 5;
__REG32 G04_0           : 5;
__REG32 B04_0           : 5;
__REG32 I0              : 1;
__REG32 R14_0           : 5;
__REG32 G14_0           : 5;
__REG32 B14_0           : 5;
__REG32 I1              : 1;
}__lcd_pal_bits;

/* Cursor Control register */
typedef struct{
__REG32 CrsrOn          : 1;
__REG32                 : 3;
__REG32 CRSRNUM1_0      : 2;
__REG32                 :26;
}__lcd_crsr_ctrl_bits;

/* Cursor Configuration register */
typedef struct{
__REG32 CrsrSize        : 1;
__REG32 FRAMESYNC       : 1;
__REG32                 :30;
}__lcd_crsr_cfg_bits;

/* Cursor Palette register 0 */
typedef struct{
__REG32 RED             : 8;
__REG32 GREEN           : 8;
__REG32 BLUE            : 8;
__REG32                 : 8;
}__lcd_crsr_pal0_bits;

/* Cursor Palette register 1 */
typedef struct{
__REG32 RED             : 8;
__REG32 GREEN           : 8;
__REG32 BLUE            : 8;
__REG32                 : 8;
}__lcd_crsr_pal1_bits;

/* Cursor XY Position register */
typedef struct{
__REG32 CRSRX           :10;
__REG32                 : 6;
__REG32 CRSRY           :10;
__REG32                 : 6;
}__lcd_crsr_xy_bits;

/* Cursor Clip Position register */
typedef struct{
__REG32 CRSRCLIPX       : 6;
__REG32                 : 2;
__REG32 CRSRCLIPY       : 6;
__REG32                 :18;
}__lcd_crsr_clip_bits;

/* Cursor Interrupt Mask register */
typedef struct{
__REG32 CRSRIM          : 1;
__REG32                 :31;
}__lcd_crsr_intmsk_bits;

/* Cursor Interrupt Clear register */

#define LCD_CRSR_INTCLR_CRSRIC      (0x00000001UL)

