una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4357_m0.h
/* Cursor Raw Interrupt Status register */
typedef struct{
__REG32 CRSRRIS         : 1;
__REG32                 :31;
}__lcd_crsr_intraw_bits;

/* Cursor Masked Interrupt Status register */
typedef struct{
__REG32 CRSRMIS         : 1;
__REG32                 :31;
}__lcd_crsr_intstat_bits;


/* SCT configuration register */
typedef struct{
__REG32 UNIFY                 : 1;
__REG32 CLKMODE               : 2;
__REG32 CLKSEL                : 4;
__REG32 NORELAODL_NORELOADU   : 1;
__REG32 NORELOADH             : 1;
__REG32 INSYNC0               : 1;
__REG32 INSYNC1               : 1;
__REG32 INSYNC2               : 1;
__REG32 INSYNC3               : 1;
__REG32 INSYNC4               : 1;
__REG32 INSYNC5               : 1;
__REG32 INSYNC6               : 1;
__REG32 INSYNC7               : 1;
__REG32                       :15;
} __sct_config_bits;

/* SCT control register */
typedef union{
  /* SCT_CTRL */
  struct{
  __REG32 DOWN_L                : 1;
  __REG32 STOP_L                : 1;
  __REG32 HALT_L                : 1;
  __REG32 CLRCTR_L              : 1;
  __REG32 BIDIR_L               : 1;
  __REG32 PRE_L                 : 8;
  __REG32                       : 3;
  __REG32 DOWN_H                : 1;
  __REG32 STOP_H                : 1;
  __REG32 HALT_H                : 1;
  __REG32 CLRCTR_H              : 1;
  __REG32 BIDIR_H               : 1;
  __REG32 PRE_H                 : 8;
  __REG32                       : 3;
  };

  struct{
    union{
      /* SCT_CTRL_L */
      struct{
      __REG16 DOWN_L                : 1;
      __REG16 STOP_L                : 1;
      __REG16 HALT_L                : 1;
      __REG16 CLRCTR_L              : 1;
      __REG16 BIDIR_L               : 1;
      __REG16 PRE_L                 : 8;
      __REG16                       : 3;
      } __sct_ctrl_l_bits;
      __REG16 __sct_ctrl_l;
    };
    union{
      /* SCT_CTRL_H */
      struct{
      __REG16 DOWN_H                : 1;
      __REG16 STOP_H                : 1;
      __REG16 HALT_H                : 1;
      __REG16 CLRCTR_H              : 1;
      __REG16 BIDIR_H               : 1;
      __REG16 PRE_H                 : 8;
      __REG16                       : 3;
      } __sct_ctrl_h_bits;
      __REG16 __sct_ctrl_h;
    };
  };
} __sct_ctrl_bits;


/* SCT limit register */
typedef union{
  /* SCT_LIMIT */
  struct{
  __REG32 LIMMSK0_L             : 1;
  __REG32 LIMMSK1_L             : 1;
  __REG32 LIMMSK2_L             : 1;
  __REG32 LIMMSK3_L             : 1;
  __REG32 LIMMSK4_L             : 1;
  __REG32 LIMMSK5_L             : 1;
  __REG32 LIMMSK6_L             : 1;
  __REG32 LIMMSK7_L             : 1;
  __REG32 LIMMSK8_L             : 1;
  __REG32 LIMMSK9_L             : 1;
  __REG32 LIMMSK10_L            : 1;
  __REG32 LIMMSK11_L            : 1;
  __REG32 LIMMSK12_L            : 1;
  __REG32 LIMMSK13_L            : 1;
  __REG32 LIMMSK14_L            : 1;
  __REG32 LIMMSK15_L            : 1;
  __REG32 LIMMSK0_H             : 1;
  __REG32 LIMMSK1_H             : 1;
  __REG32 LIMMSK2_H             : 1;
  __REG32 LIMMSK3_H             : 1;
  __REG32 LIMMSK4_H             : 1;
  __REG32 LIMMSK5_H             : 1;
  __REG32 LIMMSK6_H             : 1;
  __REG32 LIMMSK7_H             : 1;
  __REG32 LIMMSK8_H             : 1;
  __REG32 LIMMSK9_H             : 1;
  __REG32 LIMMSK10_H            : 1;
  __REG32 LIMMSK11_H            : 1;
  __REG32 LIMMSK12_H            : 1;
  __REG32 LIMMSK13_H            : 1;
  __REG32 LIMMSK14_H            : 1;
  __REG32 LIMMSK15_H            : 1;
  };

  struct{
    union{
      /* SCT_LIMIT_L */
      struct{
      __REG16 LIMMSK0_L             : 1;
      __REG16 LIMMSK1_L             : 1;
      __REG16 LIMMSK2_L             : 1;
      __REG16 LIMMSK3_L             : 1;
      __REG16 LIMMSK4_L             : 1;
      __REG16 LIMMSK5_L             : 1;
      __REG16 LIMMSK6_L             : 1;
      __REG16 LIMMSK7_L             : 1;
      __REG16 LIMMSK8_L             : 1;
      __REG16 LIMMSK9_L             : 1;
      __REG16 LIMMSK10_L            : 1;
      __REG16 LIMMSK11_L            : 1;
      __REG16 LIMMSK12_L            : 1;
      __REG16 LIMMSK13_L            : 1;
      __REG16 LIMMSK14_L            : 1;
      __REG16 LIMMSK15_L            : 1;
      } __sct_limit_l_bits;
      __REG16 __sct_limit_l;
    };
    union{
      /* SCT_LIMIT_H */
      struct{
      __REG16 LIMMSK0_H             : 1;
      __REG16 LIMMSK1_H             : 1;
      __REG16 LIMMSK2_H             : 1;
      __REG16 LIMMSK3_H             : 1;
      __REG16 LIMMSK4_H             : 1;
      __REG16 LIMMSK5_H             : 1;
      __REG16 LIMMSK6_H             : 1;
      __REG16 LIMMSK7_H             : 1;
      __REG16 LIMMSK8_H             : 1;
      __REG16 LIMMSK9_H             : 1;
      __REG16 LIMMSK10_H            : 1;
      __REG16 LIMMSK11_H            : 1;
      __REG16 LIMMSK12_H            : 1;
      __REG16 LIMMSK13_H            : 1;
      __REG16 LIMMSK14_H            : 1;
      __REG16 LIMMSK15_H            : 1;
      } __sct_limit_h_bits;
      __REG16 __sct_limit_h;
    };
  };
} __sct_limit_bits;

/* SCT halt condition register */
typedef union{
  /* SCT_HALT */
  struct{
  __REG32 HALTMSK0_L            : 1;
  __REG32 HALTMSK1_L            : 1;
  __REG32 HALTMSK2_L            : 1;
  __REG32 HALTMSK3_L            : 1;
  __REG32 HALTMSK4_L            : 1;
  __REG32 HALTMSK5_L            : 1;
  __REG32 HALTMSK6_L            : 1;
  __REG32 HALTMSK7_L            : 1;
  __REG32 HALTMSK8_L            : 1;
  __REG32 HALTMSK9_L            : 1;
  __REG32 HALTMSK10_L           : 1;
  __REG32 HALTMSK11_L           : 1;
  __REG32 HALTMSK12_L           : 1;
  __REG32 HALTMSK13_L           : 1;
  __REG32 HALTMSK14_L           : 1;
  __REG32 HALTMSK15_L           : 1;
  __REG32 HALTMSK0_H            : 1;
  __REG32 HALTMSK1_H            : 1;
  __REG32 HALTMSK2_H            : 1;
  __REG32 HALTMSK3_H            : 1;
  __REG32 HALTMSK4_H            : 1;
  __REG32 HALTMSK5_H            : 1;
  __REG32 HALTMSK6_H            : 1;
  __REG32 HALTMSK7_H            : 1;
  __REG32 HALTMSK8_H            : 1;
  __REG32 HALTMSK9_H            : 1;
  __REG32 HALTMSK10_H           : 1;
  __REG32 HALTMSK11_H           : 1;
  __REG32 HALTMSK12_H           : 1;
  __REG32 HALTMSK13_H           : 1;
  __REG32 HALTMSK14_H           : 1;
  __REG32 HALTMSK15_H           : 1;
  };

  struct{
    union{
      /* SCT_HALT_L */
      struct{
      __REG16 HALTMSK0_L            : 1;
      __REG16 HALTMSK1_L            : 1;
      __REG16 HALTMSK2_L            : 1;
      __REG16 HALTMSK3_L            : 1;
      __REG16 HALTMSK4_L            : 1;
      __REG16 HALTMSK5_L            : 1;
      __REG16 HALTMSK6_L            : 1;
      __REG16 HALTMSK7_L            : 1;
      __REG16 HALTMSK8_L            : 1;
      __REG16 HALTMSK9_L            : 1;
      __REG16 HALTMSK10_L           : 1;
      __REG16 HALTMSK11_L           : 1;
      __REG16 HALTMSK12_L           : 1;
      __REG16 HALTMSK13_L           : 1;
      __REG16 HALTMSK14_L           : 1;
      __REG16 HALTMSK15_L           : 1;
      } __sct_halt_l_bits;
      __REG16 __sct_halt_l;
    };
    union{
      /* SCT_HALT_H */
      struct{
      __REG16 HALTMSK0_H            : 1;
      __REG16 HALTMSK1_H            : 1;
      __REG16 HALTMSK2_H            : 1;
      __REG16 HALTMSK3_H            : 1;
      __REG16 HALTMSK4_H            : 1;
      __REG16 HALTMSK5_H            : 1;
      __REG16 HALTMSK6_H            : 1;
      __REG16 HALTMSK7_H            : 1;
      __REG16 HALTMSK8_H            : 1;
      __REG16 HALTMSK9_H            : 1;
      __REG16 HALTMSK10_H           : 1;
      __REG16 HALTMSK11_H           : 1;
      __REG16 HALTMSK12_H           : 1;
      __REG16 HALTMSK13_H           : 1;
      __REG16 HALTMSK14_H           : 1;
      __REG16 HALTMSK15_H           : 1;
      } __sct_halt_h_bits;
      __REG16 __sct_halt_h;
    };
  };
} __sct_halt_bits;


