una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4357_m0.h
/***************************************************************************
 **
 ** CCU2
 **
 ***************************************************************************/
__IO_REG32_BIT(CCU2_PM,                       0x40052000,__READ_WRITE ,__ccu_pm_bits);
__IO_REG32_BIT(CCU2_BASE_STAT,                0x40052004,__READ       ,__ccu2_base_stat_bits);
__IO_REG32_BIT(CCU2_CLK_APLL_CFG,             0x40052100,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APLL_STAT,            0x40052104,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART3_CFG,      0x40052200,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART3_STAT,     0x40052204,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART2_CFG,      0x40052300,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART2_STAT,     0x40052304,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_UART1_CFG,       0x40052400,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_UART1_STAT,      0x40052404,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART0_CFG,      0x40052500,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART0_STAT,     0x40052504,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_SSP1_CFG,        0x40052600,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_SSP1_STAT,       0x40052604,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_SSP0_CFG,        0x40052700,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_SSP0_STAT,       0x40052704,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_SDIO_CFG,             0x40052800,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_SDIO_STAT,            0x40052804,__READ       ,__ccu_clk_cfg_bits);

/***************************************************************************
 **
 ** RGU
 **
 ***************************************************************************/
__IO_REG32(    RGU_RESET_CTRL0,               0x40053100,__WRITE      );
__IO_REG32(    RGU_RESET_CTRL1,               0x40053104,__WRITE      );
__IO_REG32_BIT(RGU_RESET_STATUS0,             0x40053110,__READ_WRITE ,__rgu_reset_status0_bits);
__IO_REG32_BIT(RGU_RESET_STATUS1,             0x40053114,__READ_WRITE ,__rgu_reset_status1_bits);
__IO_REG32_BIT(RGU_RESET_STATUS2,             0x40053118,__READ_WRITE ,__rgu_reset_status2_bits);
__IO_REG32_BIT(RGU_RESET_STATUS3,             0x4005311C,__READ_WRITE ,__rgu_reset_status3_bits);
__IO_REG32_BIT(RGU_RESET_ACTIVE_STATUS0,      0x40053150,__READ       ,__rgu_reset_active_status0_bits);
__IO_REG32_BIT(RGU_RESET_ACTIVE_STATUS1,      0x40053154,__READ       ,__rgu_reset_active_status1_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT0,           0x40053400,__READ_WRITE ,__rgu_reset_ext_stat0_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT1,           0x40053404,__READ_WRITE ,__rgu_reset_ext_stat1_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT2,           0x40053408,__READ_WRITE ,__rgu_reset_ext_stat2_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT4,           0x40053410,__READ_WRITE ,__rgu_reset_ext_stat4_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT5,           0x40053414,__READ_WRITE ,__rgu_reset_ext_stat5_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT8,           0x40053420,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT9,           0x40053424,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT13,          0x40053434,__READ_WRITE ,__rgu_master_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT16,          0x40053440,__READ_WRITE ,__rgu_master_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT17,          0x40053444,__READ_WRITE ,__rgu_master_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT18,          0x40053448,__READ_WRITE ,__rgu_master_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT19,          0x4005344C,__READ_WRITE ,__rgu_master_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT20,          0x40053450,__READ_WRITE ,__rgu_master_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT21,          0x40053454,__READ_WRITE ,__rgu_master_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT22,          0x40053458,__READ_WRITE ,__rgu_master_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT28,          0x40053470,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT32,          0x40053480,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT33,          0x40053484,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT34,          0x40053488,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT35,          0x4005348C,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT36,          0x40053490,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT37,          0x40053494,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT38,          0x40053498,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT39,          0x4005349C,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT40,          0x400534A0,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT41,          0x400534A4,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT42,          0x400534A8,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT44,          0x400534B0,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT45,          0x400534B4,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT46,          0x400534B8,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT47,          0x400534BC,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT48,          0x400534C0,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT49,          0x400534C4,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT50,          0x400534C8,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT51,          0x400534CC,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT52,          0x400534D0,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT53,          0x400534D4,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT54,          0x400534D8,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT55,          0x400534DC,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT56,          0x400534E0,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT57,          0x400534E4,__READ_WRITE ,__rgu_peripheral_reset_bits);
__IO_REG32_BIT(RGU_RESET_EXT_STAT58,          0x400534E8,__READ_WRITE ,__rgu_peripheral_reset_bits);

