una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4357_m0.h
/***************************************************************************
 **
 ** System control unit
 **
 ***************************************************************************/
__IO_REG32_BIT(SCU_SFSP0_0,                       0x40086000,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP0_1,                       0x40086004,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_0,                       0x40086080,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_1,                       0x40086084,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_2,                       0x40086088,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_3,                       0x4008608C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_4,                       0x40086090,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_5,                       0x40086094,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_6,                       0x40086098,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_7,                       0x4008609C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_8,                       0x400860A0,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_9,                       0x400860A4,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_10,                      0x400860A8,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_11,                      0x400860AC,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_12,                      0x400860B0,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_13,                      0x400860B4,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_14,                      0x400860B8,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_15,                      0x400860BC,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_16,                      0x400860C0,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_17,                      0x400860C4,__READ_WRITE ,__scu_sfspx_hidrv_bits);
__IO_REG32_BIT(SCU_SFSP1_18,                      0x400860C8,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_19,                      0x400860CC,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP1_20,                      0x400860D0,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP2_0,                       0x40086100,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP2_1,                       0x40086104,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP2_2,                       0x40086108,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP2_3,                       0x4008610C,__READ_WRITE ,__scu_sfspx_hidrv_bits);
__IO_REG32_BIT(SCU_SFSP2_4,                       0x40086110,__READ_WRITE ,__scu_sfspx_hidrv_bits);
__IO_REG32_BIT(SCU_SFSP2_5,                       0x40086114,__READ_WRITE ,__scu_sfspx_hidrv_bits);
__IO_REG32_BIT(SCU_SFSP2_6,                       0x40086118,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP2_7,                       0x4008611C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP2_8,                       0x40086120,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP2_9,                       0x40086124,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP2_10,                      0x40086128,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP2_11,                      0x4008612C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP2_12,                      0x40086130,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP2_13,                      0x40086134,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP3_0,                       0x40086180,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP3_1,                       0x40086184,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP3_2,                       0x40086188,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP3_3,                       0x4008618C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP3_4,                       0x40086190,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP3_5,                       0x40086194,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP3_6,                       0x40086198,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP3_7,                       0x4008619C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP3_8,                       0x400861A0,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP4_0,                       0x40086200,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP4_1,                       0x40086204,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP4_2,                       0x40086208,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP4_3,                       0x4008620C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP4_4,                       0x40086210,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP4_5,                       0x40086214,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP4_6,                       0x40086218,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP4_7,                       0x4008621C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP4_8,                       0x40086220,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP4_9,                       0x40086224,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP4_10,                      0x40086228,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP5_0,                       0x40086280,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP5_1,                       0x40086284,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP5_2,                       0x40086288,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP5_3,                       0x4008628C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP5_4,                       0x40086290,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP5_5,                       0x40086294,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP5_6,                       0x40086298,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP5_7,                       0x4008629C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP6_0,                       0x40086300,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP6_1,                       0x40086304,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP6_2,                       0x40086308,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP6_3,                       0x4008630C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP6_4,                       0x40086310,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP6_5,                       0x40086314,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP6_6,                       0x40086318,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP6_7,                       0x4008631C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP6_8,                       0x40086320,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP6_9,                       0x40086324,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP6_10,                      0x40086328,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP6_11,                      0x4008632C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP6_12,                      0x40086330,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP7_0,                       0x40086380,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP7_1,                       0x40086384,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP7_2,                       0x40086388,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP7_3,                       0x4008638C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP7_4,                       0x40086390,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP7_5,                       0x40086394,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP7_6,                       0x40086398,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP7_7,                       0x4008639C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP8_0,                       0x40086400,__READ_WRITE ,__scu_sfspx_hidrv_bits);
__IO_REG32_BIT(SCU_SFSP8_1,                       0x40086404,__READ_WRITE ,__scu_sfspx_hidrv_bits);
__IO_REG32_BIT(SCU_SFSP8_2,                       0x40086408,__READ_WRITE ,__scu_sfspx_hidrv_bits);
__IO_REG32_BIT(SCU_SFSP8_3,                       0x4008640C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP8_4,                       0x40086410,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP8_5,                       0x40086414,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP8_6,                       0x40086418,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP8_7,                       0x4008641C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP8_8,                       0x40086420,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP9_0,                       0x40086480,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP9_1,                       0x40086484,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP9_2,                       0x40086488,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP9_3,                       0x4008648C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP9_4,                       0x40086490,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP9_5,                       0x40086494,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSP9_6,                       0x40086498,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPA_0,                       0x40086500,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPA_1,                       0x40086504,__READ_WRITE ,__scu_sfspx_hidrv_bits);
__IO_REG32_BIT(SCU_SFSPA_2,                       0x40086508,__READ_WRITE ,__scu_sfspx_hidrv_bits);
__IO_REG32_BIT(SCU_SFSPA_3,                       0x4008650C,__READ_WRITE ,__scu_sfspx_hidrv_bits);
__IO_REG32_BIT(SCU_SFSPA_4,                       0x40086510,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPB_0,                       0x40086580,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPB_1,                       0x40086584,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPB_2,                       0x40086588,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPB_3,                       0x4008658C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPB_4,                       0x40086590,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPB_5,                       0x40086594,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPB_6,                       0x40086598,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPC_0,                       0x40086600,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPC_1,                       0x40086604,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPC_2,                       0x40086608,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPC_3,                       0x4008660C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPC_4,                       0x40086610,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPC_5,                       0x40086614,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPC_6,                       0x40086618,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPC_7,                       0x4008661C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPC_8,                       0x40086620,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPC_9,                       0x40086624,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPC_10,                      0x40086628,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPC_11,                      0x4008662C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPC_12,                      0x40086630,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPC_13,                      0x40086634,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPC_14,                      0x40086638,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_0,                       0x40086680,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_1,                       0x40086684,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_2,                       0x40086688,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_3,                       0x4008668C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_4,                       0x40086690,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_5,                       0x40086694,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_6,                       0x40086698,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_7,                       0x4008669C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_8,                       0x400866A0,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_9,                       0x400866A4,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_10,                      0x400866A8,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_11,                      0x400866AC,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_12,                      0x400866B0,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_13,                      0x400866B4,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_14,                      0x400866B8,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_15,                      0x400866BC,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPD_16,                      0x400866C0,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_0,                       0x40086700,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_1,                       0x40086704,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_2,                       0x40086708,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_3,                       0x4008670C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_4,                       0x40086710,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_5,                       0x40086714,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_6,                       0x40086718,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_7,                       0x4008671C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_8,                       0x40086720,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_9,                       0x40086724,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_10,                      0x40086728,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_11,                      0x4008672C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_12,                      0x40086730,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_13,                      0x40086734,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_14,                      0x40086738,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPE_15,                      0x4008673C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPF_0,                       0x40086780,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPF_1,                       0x40086784,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPF_2,                       0x40086788,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPF_3,                       0x4008678C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPF_4,                       0x40086790,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPF_5,                       0x40086794,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPF_6,                       0x40086798,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPF_7,                       0x4008679C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPF_8,                       0x400867A0,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPF_9,                       0x400867A4,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPF_10,                      0x400867A8,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPF_11,                      0x400867AC,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSCLK0,                       0x40086C00,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSCLK1,                       0x40086C04,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSCLK2,                       0x40086C08,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSCLK3,                       0x40086C0C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSUSB,                        0x40086C80,__READ_WRITE ,__scu_sfsusb_bits);
__IO_REG32_BIT(SCU_SFSI2C0,                       0x40086C84,__READ_WRITE ,__scu_sfsi2c0_bits);
__IO_REG32_BIT(SCU_ENAIO0,                        0x40086C88,__READ_WRITE ,__scu_enaio0_bits);
__IO_REG32_BIT(SCU_ENAIO1,                        0x40086C8C,__READ_WRITE ,__scu_enaio1_bits);
__IO_REG32_BIT(SCU_ENAIO2,                        0x40086C90,__READ_WRITE ,__scu_enaio2_bits);
__IO_REG32_BIT(SCU_EMCDELAYCLK,                   0x40086D00,__READ_WRITE ,__scu_emcdelayclk_bits);
__IO_REG32_BIT(SCU_PINTSEL0,                      0x40086E00,__READ_WRITE ,__scu_pintsel0_bits);
__IO_REG32_BIT(SCU_PINTSEL1,                      0x40086E04,__READ_WRITE ,__scu_pintsel1_bits);

/***************************************************************************
 **
 ** GIMA
 **
 ***************************************************************************/

__IO_REG32_BIT(GIMA_CAP0_0_IN,                    0x400C7000,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP0_1_IN,                    0x400C7004,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP0_2_IN,                    0x400C7008,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP0_3_IN,                    0x400C700C,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP1_0_IN,                    0x400C7010,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP1_1_IN,                    0x400C7014,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP1_2_IN,                    0x400C7018,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP1_3_IN,                    0x400C701C,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP2_0_IN,                    0x400C7020,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP2_1_IN,                    0x400C7024,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP2_2_IN,                    0x400C7028,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP2_3_IN,                    0x400C702C,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP3_0_IN,                    0x400C7030,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP3_1_IN,                    0x400C7034,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP3_2_IN,                    0x400C7038,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP3_3_IN,                    0x400C703C,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_0_IN,                    0x400C7040,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_1_IN,                    0x400C7044,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_2_IN,                    0x400C7048,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_3_IN,                    0x400C704C,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_4_IN,                    0x400C7050,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_5_IN,                    0x400C7054,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_6_IN,                    0x400C7058,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_7_IN,                    0x400C705C,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_VADC_TRIGGER_IN,              0x400C7060,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_EVENTROUTER_13_IN,            0x400C7064,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_EVENTROUTER_14_IN,            0x400C7068,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_EVENTROUTER_16_IN,            0x400C706C,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_ADCSTART0_IN,                 0x400C7070,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_ADCSTART1_IN,                 0x400C7074,__READ_WRITE ,__gima_in_bits);

/***************************************************************************
 **
 ** GPIO
 **
 ***************************************************************************/

