una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4357_m0.h
__IO_REG32_BIT(GPIO_ISEL,         0x40087000,__READ_WRITE,__gpio_isel_bits);
__IO_REG32_BIT(GPIO_IENR,         0x40087004,__READ_WRITE,__gpio_ienr_bits);
__IO_REG32(    GPIO_SIENR,        0x40087008,__WRITE     );
__IO_REG32(    GPIO_CIENR,        0x4008700C,__WRITE     );
__IO_REG32_BIT(GPIO_IENF,         0x40087010,__READ_WRITE,__gpio_ienf_bits);
__IO_REG32(    GPIO_SIENF,        0x40087014,__WRITE     );
__IO_REG32(    GPIO_CIENF,        0x40087018,__WRITE     );
__IO_REG32_BIT(GPIO_RISE,         0x4008701C,__READ_WRITE,__gpio_rise_bits);
__IO_REG32_BIT(GPIO_FALL,         0x40087020,__READ_WRITE,__gpio_fall_bits);
__IO_REG32_BIT(GPIO_IST,          0x40087024,__READ_WRITE,__gpio_ist_bits);

__IO_REG32_BIT(GPIOG0_CTRL,       0x40088000,__READ_WRITE,__gpiogx_ctrl_bits);
__IO_REG32(    GPIOG0_PORT_POL0,  0x40088020,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_POL1,  0x40088024,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_POL2,  0x40088028,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_POL3,  0x4008802C,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_POL4,  0x40088030,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_POL5,  0x40088034,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_POL6,  0x40088038,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_POL7,  0x4008803C,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA0,  0x40088040,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA1,  0x40088044,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA2,  0x40088048,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA3,  0x4008804C,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA4,  0x40088050,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA5,  0x40088054,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA6,  0x40088058,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA7,  0x4008805C,__READ_WRITE);

__IO_REG32_BIT(GPIOG1_CTRL,       0x40089000,__READ_WRITE,__gpiogx_ctrl_bits);
__IO_REG32(    GPIOG1_PORT_POL0,  0x40089020,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_POL1,  0x40089024,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_POL2,  0x40089028,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_POL3,  0x4008902C,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_POL4,  0x40089030,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_POL5,  0x40089034,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_POL6,  0x40089038,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_POL7,  0x4008903C,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA0,  0x40089040,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA1,  0x40089044,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA2,  0x40089048,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA3,  0x4008904C,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA4,  0x40089050,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA5,  0x40089054,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA6,  0x40089058,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA7,  0x4008905C,__READ_WRITE);

__IO_REG8(     GPIO_B0,           0x400F4000,__READ_WRITE);
__IO_REG8(     GPIO_B1,           0x400F4001,__READ_WRITE);
__IO_REG8(     GPIO_B2,           0x400F4002,__READ_WRITE);
__IO_REG8(     GPIO_B3,           0x400F4003,__READ_WRITE);
__IO_REG8(     GPIO_B4,           0x400F4004,__READ_WRITE);
__IO_REG8(     GPIO_B5,           0x400F4005,__READ_WRITE);
__IO_REG8(     GPIO_B6,           0x400F4006,__READ_WRITE);
__IO_REG8(     GPIO_B7,           0x400F4007,__READ_WRITE);
__IO_REG8(     GPIO_B8,           0x400F4008,__READ_WRITE);
__IO_REG8(     GPIO_B9,           0x400F4009,__READ_WRITE);
__IO_REG8(     GPIO_B10,          0x400F400A,__READ_WRITE);
__IO_REG8(     GPIO_B11,          0x400F400B,__READ_WRITE);
__IO_REG8(     GPIO_B12,          0x400F400C,__READ_WRITE);
__IO_REG8(     GPIO_B13,          0x400F400D,__READ_WRITE);
__IO_REG8(     GPIO_B14,          0x400F400E,__READ_WRITE);
__IO_REG8(     GPIO_B15,          0x400F400F,__READ_WRITE);

__IO_REG8(     GPIO_B32,          0x400F4020,__READ_WRITE);
__IO_REG8(     GPIO_B33,          0x400F4021,__READ_WRITE);
__IO_REG8(     GPIO_B34,          0x400F4022,__READ_WRITE);
__IO_REG8(     GPIO_B35,          0x400F4023,__READ_WRITE);
__IO_REG8(     GPIO_B36,          0x400F4024,__READ_WRITE);
__IO_REG8(     GPIO_B37,          0x400F4025,__READ_WRITE);
__IO_REG8(     GPIO_B38,          0x400F4026,__READ_WRITE);
__IO_REG8(     GPIO_B39,          0x400F4027,__READ_WRITE);
__IO_REG8(     GPIO_B40,          0x400F4028,__READ_WRITE);
__IO_REG8(     GPIO_B41,          0x400F4029,__READ_WRITE);
__IO_REG8(     GPIO_B42,          0x400F402A,__READ_WRITE);
__IO_REG8(     GPIO_B43,          0x400F402B,__READ_WRITE);
__IO_REG8(     GPIO_B44,          0x400F402C,__READ_WRITE);
__IO_REG8(     GPIO_B45,          0x400F402D,__READ_WRITE);
__IO_REG8(     GPIO_B46,          0x400F402E,__READ_WRITE);
__IO_REG8(     GPIO_B47,          0x400F402F,__READ_WRITE);

__IO_REG8(     GPIO_B64,          0x400F4040,__READ_WRITE);
__IO_REG8(     GPIO_B65,          0x400F4041,__READ_WRITE);
__IO_REG8(     GPIO_B66,          0x400F4042,__READ_WRITE);
__IO_REG8(     GPIO_B67,          0x400F4043,__READ_WRITE);
__IO_REG8(     GPIO_B68,          0x400F4044,__READ_WRITE);
__IO_REG8(     GPIO_B69,          0x400F4045,__READ_WRITE);
__IO_REG8(     GPIO_B70,          0x400F4046,__READ_WRITE);
__IO_REG8(     GPIO_B71,          0x400F4047,__READ_WRITE);
__IO_REG8(     GPIO_B72,          0x400F4048,__READ_WRITE);
__IO_REG8(     GPIO_B73,          0x400F4049,__READ_WRITE);
__IO_REG8(     GPIO_B74,          0x400F404A,__READ_WRITE);
__IO_REG8(     GPIO_B75,          0x400F404B,__READ_WRITE);
__IO_REG8(     GPIO_B76,          0x400F404C,__READ_WRITE);
__IO_REG8(     GPIO_B77,          0x400F404D,__READ_WRITE);
__IO_REG8(     GPIO_B78,          0x400F404E,__READ_WRITE);
__IO_REG8(     GPIO_B79,          0x400F404F,__READ_WRITE);

__IO_REG8(     GPIO_B96,          0x400F4060,__READ_WRITE);
__IO_REG8(     GPIO_B97,          0x400F4061,__READ_WRITE);
__IO_REG8(     GPIO_B98,          0x400F4062,__READ_WRITE);
__IO_REG8(     GPIO_B99,          0x400F4063,__READ_WRITE);
__IO_REG8(     GPIO_B100,         0x400F4064,__READ_WRITE);
__IO_REG8(     GPIO_B101,         0x400F4065,__READ_WRITE);
__IO_REG8(     GPIO_B102,         0x400F4066,__READ_WRITE);
__IO_REG8(     GPIO_B103,         0x400F4067,__READ_WRITE);
__IO_REG8(     GPIO_B104,         0x400F4068,__READ_WRITE);
__IO_REG8(     GPIO_B105,         0x400F4069,__READ_WRITE);
__IO_REG8(     GPIO_B106,         0x400F406A,__READ_WRITE);
__IO_REG8(     GPIO_B107,         0x400F406B,__READ_WRITE);
__IO_REG8(     GPIO_B108,         0x400F406C,__READ_WRITE);
__IO_REG8(     GPIO_B109,         0x400F406D,__READ_WRITE);
__IO_REG8(     GPIO_B110,         0x400F406E,__READ_WRITE);
__IO_REG8(     GPIO_B111,         0x400F406F,__READ_WRITE);

