una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4357_m0.h
__IO_REG32(    GPIO_W32,          0x400F5080,__READ_WRITE);
__IO_REG32(    GPIO_W33,          0x400F5084,__READ_WRITE);
__IO_REG32(    GPIO_W34,          0x400F5088,__READ_WRITE);
__IO_REG32(    GPIO_W35,          0x400F508C,__READ_WRITE);
__IO_REG32(    GPIO_W36,          0x400F5090,__READ_WRITE);
__IO_REG32(    GPIO_W37,          0x400F5094,__READ_WRITE);
__IO_REG32(    GPIO_W38,          0x400F5098,__READ_WRITE);
__IO_REG32(    GPIO_W39,          0x400F509C,__READ_WRITE);
__IO_REG32(    GPIO_W40,          0x400F50A0,__READ_WRITE);
__IO_REG32(    GPIO_W41,          0x400F50A4,__READ_WRITE);
__IO_REG32(    GPIO_W42,          0x400F50A8,__READ_WRITE);
__IO_REG32(    GPIO_W43,          0x400F50AC,__READ_WRITE);
__IO_REG32(    GPIO_W44,          0x400F50B0,__READ_WRITE);
__IO_REG32(    GPIO_W45,          0x400F50B4,__READ_WRITE);
__IO_REG32(    GPIO_W46,          0x400F50B8,__READ_WRITE);
__IO_REG32(    GPIO_W47,          0x400F50BC,__READ_WRITE);

__IO_REG32(    GPIO_W64,          0x400F5100,__READ_WRITE);
__IO_REG32(    GPIO_W65,          0x400F5104,__READ_WRITE);
__IO_REG32(    GPIO_W66,          0x400F5108,__READ_WRITE);
__IO_REG32(    GPIO_W67,          0x400F510C,__READ_WRITE);
__IO_REG32(    GPIO_W68,          0x400F5110,__READ_WRITE);
__IO_REG32(    GPIO_W69,          0x400F5114,__READ_WRITE);
__IO_REG32(    GPIO_W70,          0x400F5118,__READ_WRITE);
__IO_REG32(    GPIO_W71,          0x400F511C,__READ_WRITE);
__IO_REG32(    GPIO_W72,          0x400F5120,__READ_WRITE);
__IO_REG32(    GPIO_W73,          0x400F5124,__READ_WRITE);
__IO_REG32(    GPIO_W74,          0x400F5128,__READ_WRITE);
__IO_REG32(    GPIO_W75,          0x400F512C,__READ_WRITE);
__IO_REG32(    GPIO_W76,          0x400F5130,__READ_WRITE);
__IO_REG32(    GPIO_W77,          0x400F5134,__READ_WRITE);
__IO_REG32(    GPIO_W78,          0x400F5138,__READ_WRITE);
__IO_REG32(    GPIO_W79,          0x400F513C,__READ_WRITE);

__IO_REG32(    GPIO_W96,          0x400F5180,__READ_WRITE);
__IO_REG32(    GPIO_W97,          0x400F5184,__READ_WRITE);
__IO_REG32(    GPIO_W98,          0x400F5188,__READ_WRITE);
__IO_REG32(    GPIO_W99,          0x400F518C,__READ_WRITE);
__IO_REG32(    GPIO_W100,         0x400F5190,__READ_WRITE);
__IO_REG32(    GPIO_W101,         0x400F5194,__READ_WRITE);
__IO_REG32(    GPIO_W102,         0x400F5198,__READ_WRITE);
__IO_REG32(    GPIO_W103,         0x400F519C,__READ_WRITE);
__IO_REG32(    GPIO_W104,         0x400F51A0,__READ_WRITE);
__IO_REG32(    GPIO_W105,         0x400F51A4,__READ_WRITE);
__IO_REG32(    GPIO_W106,         0x400F51A8,__READ_WRITE);
__IO_REG32(    GPIO_W107,         0x400F51AC,__READ_WRITE);
__IO_REG32(    GPIO_W108,         0x400F51B0,__READ_WRITE);
__IO_REG32(    GPIO_W109,         0x400F51B4,__READ_WRITE);
__IO_REG32(    GPIO_W110,         0x400F51B8,__READ_WRITE);
__IO_REG32(    GPIO_W111,         0x400F51BC,__READ_WRITE);

__IO_REG32(    GPIO_W128,         0x400F5200,__READ_WRITE);
__IO_REG32(    GPIO_W129,         0x400F5204,__READ_WRITE);
__IO_REG32(    GPIO_W130,         0x400F5208,__READ_WRITE);
__IO_REG32(    GPIO_W131,         0x400F520C,__READ_WRITE);
__IO_REG32(    GPIO_W132,         0x400F5210,__READ_WRITE);
__IO_REG32(    GPIO_W133,         0x400F5214,__READ_WRITE);
__IO_REG32(    GPIO_W134,         0x400F5218,__READ_WRITE);
__IO_REG32(    GPIO_W135,         0x400F521C,__READ_WRITE);
__IO_REG32(    GPIO_W136,         0x400F5220,__READ_WRITE);
__IO_REG32(    GPIO_W137,         0x400F5224,__READ_WRITE);
__IO_REG32(    GPIO_W138,         0x400F5228,__READ_WRITE);
__IO_REG32(    GPIO_W139,         0x400F522C,__READ_WRITE);
__IO_REG32(    GPIO_W140,         0x400F5230,__READ_WRITE);
__IO_REG32(    GPIO_W141,         0x400F5234,__READ_WRITE);
__IO_REG32(    GPIO_W142,         0x400F5238,__READ_WRITE);
__IO_REG32(    GPIO_W143,         0x400F523C,__READ_WRITE);

__IO_REG32(    GPIO_W160,         0x400F5280,__READ_WRITE);
__IO_REG32(    GPIO_W161,         0x400F5284,__READ_WRITE);
__IO_REG32(    GPIO_W162,         0x400F5288,__READ_WRITE);
__IO_REG32(    GPIO_W163,         0x400F528C,__READ_WRITE);
__IO_REG32(    GPIO_W164,         0x400F5290,__READ_WRITE);
__IO_REG32(    GPIO_W165,         0x400F5294,__READ_WRITE);
__IO_REG32(    GPIO_W166,         0x400F5298,__READ_WRITE);
__IO_REG32(    GPIO_W167,         0x400F529C,__READ_WRITE);
__IO_REG32(    GPIO_W168,         0x400F52A0,__READ_WRITE);
__IO_REG32(    GPIO_W169,         0x400F52A4,__READ_WRITE);
__IO_REG32(    GPIO_W170,         0x400F52A8,__READ_WRITE);
__IO_REG32(    GPIO_W171,         0x400F52AC,__READ_WRITE);
__IO_REG32(    GPIO_W172,         0x400F52B0,__READ_WRITE);
__IO_REG32(    GPIO_W173,         0x400F52B4,__READ_WRITE);
__IO_REG32(    GPIO_W174,         0x400F52B8,__READ_WRITE);
__IO_REG32(    GPIO_W175,         0x400F52BC,__READ_WRITE);
__IO_REG32(    GPIO_W176,         0x400F52C0,__READ_WRITE);
__IO_REG32(    GPIO_W177,         0x400F52C4,__READ_WRITE);
__IO_REG32(    GPIO_W178,         0x400F52C8,__READ_WRITE);
__IO_REG32(    GPIO_W179,         0x400F52CC,__READ_WRITE);
__IO_REG32(    GPIO_W180,         0x400F52D0,__READ_WRITE);
__IO_REG32(    GPIO_W181,         0x400F52D4,__READ_WRITE);
__IO_REG32(    GPIO_W182,         0x400F52D8,__READ_WRITE);
__IO_REG32(    GPIO_W183,         0x400F52DC,__READ_WRITE);
__IO_REG32(    GPIO_W184,         0x400F52E0,__READ_WRITE);
__IO_REG32(    GPIO_W185,         0x400F52E4,__READ_WRITE);
__IO_REG32(    GPIO_W186,         0x400F52E8,__READ_WRITE);

__IO_REG32(    GPIO_W192,         0x400F5300,__READ_WRITE);
__IO_REG32(    GPIO_W193,         0x400F5304,__READ_WRITE);
__IO_REG32(    GPIO_W194,         0x400F5308,__READ_WRITE);
__IO_REG32(    GPIO_W195,         0x400F530C,__READ_WRITE);
__IO_REG32(    GPIO_W196,         0x400F5310,__READ_WRITE);
__IO_REG32(    GPIO_W197,         0x400F5314,__READ_WRITE);
__IO_REG32(    GPIO_W198,         0x400F5318,__READ_WRITE);
__IO_REG32(    GPIO_W199,         0x400F531C,__READ_WRITE);
__IO_REG32(    GPIO_W200,         0x400F5320,__READ_WRITE);
__IO_REG32(    GPIO_W201,         0x400F5324,__READ_WRITE);
__IO_REG32(    GPIO_W202,         0x400F5328,__READ_WRITE);
__IO_REG32(    GPIO_W203,         0x400F532C,__READ_WRITE);
__IO_REG32(    GPIO_W204,         0x400F5330,__READ_WRITE);
__IO_REG32(    GPIO_W205,         0x400F5334,__READ_WRITE);
__IO_REG32(    GPIO_W206,         0x400F5338,__READ_WRITE);
__IO_REG32(    GPIO_W207,         0x400F533C,__READ_WRITE);
__IO_REG32(    GPIO_W208,         0x400F5340,__READ_WRITE);
__IO_REG32(    GPIO_W209,         0x400F5344,__READ_WRITE);
__IO_REG32(    GPIO_W210,         0x400F5348,__READ_WRITE);
__IO_REG32(    GPIO_W211,         0x400F534C,__READ_WRITE);
__IO_REG32(    GPIO_W212,         0x400F5350,__READ_WRITE);
__IO_REG32(    GPIO_W213,         0x400F5354,__READ_WRITE);
__IO_REG32(    GPIO_W214,         0x400F5358,__READ_WRITE);
__IO_REG32(    GPIO_W215,         0x400F535C,__READ_WRITE);
__IO_REG32(    GPIO_W216,         0x400F5360,__READ_WRITE);
__IO_REG32(    GPIO_W217,         0x400F5364,__READ_WRITE);
__IO_REG32(    GPIO_W218,         0x400F5368,__READ_WRITE);
__IO_REG32(    GPIO_W219,         0x400F536C,__READ_WRITE);
__IO_REG32(    GPIO_W220,         0x400F5370,__READ_WRITE);
__IO_REG32(    GPIO_W221,         0x400F5374,__READ_WRITE);
__IO_REG32(    GPIO_W222,         0x400F5378,__READ_WRITE);

__IO_REG32(    GPIO_W224,         0x400F5380,__READ_WRITE);
__IO_REG32(    GPIO_W225,         0x400F5384,__READ_WRITE);
__IO_REG32(    GPIO_W226,         0x400F5388,__READ_WRITE);
__IO_REG32(    GPIO_W227,         0x400F538C,__READ_WRITE);
__IO_REG32(    GPIO_W228,         0x400F5390,__READ_WRITE);
__IO_REG32(    GPIO_W229,         0x400F5394,__READ_WRITE);
__IO_REG32(    GPIO_W230,         0x400F5398,__READ_WRITE);
__IO_REG32(    GPIO_W231,         0x400F539C,__READ_WRITE);
__IO_REG32(    GPIO_W232,         0x400F53A0,__READ_WRITE);
__IO_REG32(    GPIO_W233,         0x400F53A4,__READ_WRITE);
__IO_REG32(    GPIO_W234,         0x400F53A8,__READ_WRITE);
__IO_REG32(    GPIO_W235,         0x400F53AC,__READ_WRITE);
__IO_REG32(    GPIO_W236,         0x400F53B0,__READ_WRITE);
__IO_REG32(    GPIO_W237,         0x400F53B4,__READ_WRITE);
__IO_REG32(    GPIO_W238,         0x400F53B8,__READ_WRITE);
__IO_REG32(    GPIO_W239,         0x400F53BC,__READ_WRITE);
__IO_REG32(    GPIO_W240,         0x400F53C0,__READ_WRITE);
__IO_REG32(    GPIO_W241,         0x400F53C4,__READ_WRITE);
__IO_REG32(    GPIO_W242,         0x400F53C8,__READ_WRITE);
__IO_REG32(    GPIO_W243,         0x400F53CC,__READ_WRITE);
__IO_REG32(    GPIO_W244,         0x400F53D0,__READ_WRITE);
__IO_REG32(    GPIO_W245,         0x400F53D4,__READ_WRITE);
__IO_REG32(    GPIO_W246,         0x400F53D8,__READ_WRITE);
__IO_REG32(    GPIO_W247,         0x400F53DC,__READ_WRITE);
__IO_REG32(    GPIO_W248,         0x400F53E0,__READ_WRITE);
__IO_REG32(    GPIO_W249,         0x400F53E4,__READ_WRITE);

__IO_REG32(    GPIO_DIR0,         0x400F6000,__READ_WRITE);
__IO_REG32(    GPIO_DIR1,         0x400F6004,__READ_WRITE);
__IO_REG32(    GPIO_DIR2,         0x400F6008,__READ_WRITE);
__IO_REG32(    GPIO_DIR3,         0x400F600C,__READ_WRITE);
__IO_REG32(    GPIO_DIR4,         0x400F6010,__READ_WRITE);
__IO_REG32(    GPIO_DIR5,         0x400F6014,__READ_WRITE);
__IO_REG32(    GPIO_DIR6,         0x400F6018,__READ_WRITE);
__IO_REG32(    GPIO_DIR7,         0x400F601C,__READ_WRITE);

__IO_REG32(    GPIO_MASK0,        0x400F6080,__READ_WRITE);
__IO_REG32(    GPIO_MASK1,        0x400F6084,__READ_WRITE);
__IO_REG32(    GPIO_MASK2,        0x400F6088,__READ_WRITE);
__IO_REG32(    GPIO_MASK3,        0x400F608C,__READ_WRITE);
__IO_REG32(    GPIO_MASK4,        0x400F6090,__READ_WRITE);
__IO_REG32(    GPIO_MASK5,        0x400F6094,__READ_WRITE);
__IO_REG32(    GPIO_MASK6,        0x400F6098,__READ_WRITE);
__IO_REG32(    GPIO_MASK7,        0x400F609C,__READ_WRITE);

__IO_REG32(    GPIO_PIN0,         0x400F6100,__READ_WRITE);
__IO_REG32(    GPIO_PIN1,         0x400F6104,__READ_WRITE);
__IO_REG32(    GPIO_PIN2,         0x400F6108,__READ_WRITE);
__IO_REG32(    GPIO_PIN3,         0x400F610C,__READ_WRITE);
__IO_REG32(    GPIO_PIN4,         0x400F6110,__READ_WRITE);
__IO_REG32(    GPIO_PIN5,         0x400F6114,__READ_WRITE);
__IO_REG32(    GPIO_PIN6,         0x400F6118,__READ_WRITE);
__IO_REG32(    GPIO_PIN7,         0x400F611C,__READ_WRITE);

__IO_REG32(    GPIO_MPIN0,        0x400F6180,__READ_WRITE);
__IO_REG32(    GPIO_MPIN1,        0x400F6184,__READ_WRITE);
__IO_REG32(    GPIO_MPIN2,        0x400F6188,__READ_WRITE);
__IO_REG32(    GPIO_MPIN3,        0x400F618C,__READ_WRITE);
__IO_REG32(    GPIO_MPIN4,        0x400F6190,__READ_WRITE);
__IO_REG32(    GPIO_MPIN5,        0x400F6194,__READ_WRITE);
__IO_REG32(    GPIO_MPIN6,        0x400F6198,__READ_WRITE);
__IO_REG32(    GPIO_MPIN7,        0x400F619C,__READ_WRITE);

__IO_REG32(    GPIO_SET0,         0x400F6200,__READ_WRITE);
__IO_REG32(    GPIO_SET1,         0x400F6204,__READ_WRITE);
__IO_REG32(    GPIO_SET2,         0x400F6208,__READ_WRITE);
__IO_REG32(    GPIO_SET3,         0x400F620C,__READ_WRITE);
__IO_REG32(    GPIO_SET4,         0x400F6210,__READ_WRITE);
__IO_REG32(    GPIO_SET5,         0x400F6214,__READ_WRITE);
__IO_REG32(    GPIO_SET6,         0x400F6218,__READ_WRITE);
__IO_REG32(    GPIO_SET7,         0x400F621C,__READ_WRITE);

__IO_REG32(    GPIO_CLR0,         0x400F6280,__WRITE);
__IO_REG32(    GPIO_CLR1,         0x400F6284,__WRITE);
__IO_REG32(    GPIO_CLR2,         0x400F6288,__WRITE);
__IO_REG32(    GPIO_CLR3,         0x400F628C,__WRITE);
__IO_REG32(    GPIO_CLR4,         0x400F6290,__WRITE);
__IO_REG32(    GPIO_CLR5,         0x400F6294,__WRITE);
__IO_REG32(    GPIO_CLR6,         0x400F6298,__WRITE);
__IO_REG32(    GPIO_CLR7,         0x400F629C,__WRITE);

__IO_REG32(    GPIO_NOT0,         0x400F6300,__WRITE);
__IO_REG32(    GPIO_NOT1,         0x400F6304,__WRITE);
__IO_REG32(    GPIO_NOT2,         0x400F6308,__WRITE);
__IO_REG32(    GPIO_NOT3,         0x400F630C,__WRITE);
__IO_REG32(    GPIO_NOT4,         0x400F6310,__WRITE);
__IO_REG32(    GPIO_NOT5,         0x400F6314,__WRITE);
__IO_REG32(    GPIO_NOT6,         0x400F6318,__WRITE);
__IO_REG32(    GPIO_NOT7,         0x400F631C,__WRITE);

/***************************************************************************
 **
 ** SGPIO
 **
 ***************************************************************************/

__IO_REG32_BIT(SGPIO_OUT_MUX_CFG0,    0x40101000,__READ_WRITE,__sgpio_out_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_OUT_MUX_CFG1,    0x40101004,__READ_WRITE,__sgpio_out_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_OUT_MUX_CFG2,    0x40101008,__READ_WRITE,__sgpio_out_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_OUT_MUX_CFG3,    0x4010100C,__READ_WRITE,__sgpio_out_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_OUT_MUX_CFG4,    0x40101010,__READ_WRITE,__sgpio_out_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_OUT_MUX_CFG5,    0x40101014,__READ_WRITE,__sgpio_out_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_OUT_MUX_CFG6,    0x40101018,__READ_WRITE,__sgpio_out_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_OUT_MUX_CFG7,    0x4010101C,__READ_WRITE,__sgpio_out_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_OUT_MUX_CFG8,    0x40101020,__READ_WRITE,__sgpio_out_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_OUT_MUX_CFG9,    0x40101024,__READ_WRITE,__sgpio_out_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_OUT_MUX_CFG10,   0x40101028,__READ_WRITE,__sgpio_out_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_OUT_MUX_CFG11,   0x4010102C,__READ_WRITE,__sgpio_out_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_OUT_MUX_CFG12,   0x40101030,__READ_WRITE,__sgpio_out_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_OUT_MUX_CFG13,   0x40101034,__READ_WRITE,__sgpio_out_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_OUT_MUX_CFG14,   0x40101038,__READ_WRITE,__sgpio_out_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_OUT_MUX_CFG15,   0x4010103C,__READ_WRITE,__sgpio_out_mux_cfgx_bits);

__IO_REG32_BIT(SGPIO_MUX_CFG0,        0x40101040,__READ_WRITE,__sgpio_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_MUX_CFG1,        0x40101044,__READ_WRITE,__sgpio_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_MUX_CFG2,        0x40101048,__READ_WRITE,__sgpio_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_MUX_CFG3,        0x4010104C,__READ_WRITE,__sgpio_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_MUX_CFG4,        0x40101050,__READ_WRITE,__sgpio_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_MUX_CFG5,        0x40101054,__READ_WRITE,__sgpio_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_MUX_CFG6,        0x40101058,__READ_WRITE,__sgpio_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_MUX_CFG7,        0x4010105C,__READ_WRITE,__sgpio_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_MUX_CFG8,        0x40101060,__READ_WRITE,__sgpio_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_MUX_CFG9,        0x40101064,__READ_WRITE,__sgpio_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_MUX_CFG10,       0x40101068,__READ_WRITE,__sgpio_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_MUX_CFG11,       0x4010106C,__READ_WRITE,__sgpio_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_MUX_CFG12,       0x40101070,__READ_WRITE,__sgpio_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_MUX_CFG13,       0x40101074,__READ_WRITE,__sgpio_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_MUX_CFG14,       0x40101078,__READ_WRITE,__sgpio_mux_cfgx_bits);
__IO_REG32_BIT(SGPIO_MUX_CFG15,       0x4010107C,__READ_WRITE,__sgpio_mux_cfgx_bits);

