una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4357_m0.h
#define PWR_STATE_DEEP_SLEEP      0x003000AA
#define PWR_STATE_POWER_DOWN      0x0030FCBA
#define PWR_STATE_DEEP_POWER_DOWN 0x003FFF7F

#endif    /* __IOLPC4350_M0_H */

/*###DDF-INTERRUPT-BEGIN###
Interrupt0   = NMI                    0x08
Interrupt1   = HardFault              0x0C
Interrupt2   = MemManage              0x10
Interrupt3   = BusFault               0x14
Interrupt4   = UsageFault             0x18
Interrupt5   = SVC                    0x2C
Interrupt6   = DebugMon               0x30
Interrupt7   = PendSV                 0x38
Interrupt8   = SysTick                0x3C
Interrupt9   = M0_RTC                 0x40
Interrupt10  = M0_M4CORE              0x44
Interrupt11  = M0_DMA                 0x48
Interrupt12  = M0_ETHERNET            0x54
Interrupt13  = M0_SDIO                0x58
Interrupt14  = M0_LCD                 0x5C
Interrupt15  = M0_USB0                0x60
Interrupt16  = M0_USB1                0x64
Interrupt17  = M0_SCT                 0x68
Interrupt18  = M0_RITIMER_OR_WWDT     0x6C
Interrupt19  = M0_TIMER0              0x70
Interrupt20  = M0_GINT1               0x74
Interrupt21  = M0_PIN_INT4            0x78
Interrupt22  = M0_TIMER3              0x7C
Interrupt23  = M0_MCPWM               0x80
Interrupt24  = M0_ADC0                0x84
Interrupt25  = M0_I2C0_OR_I2C1        0x88
Interrupt26  = M0_SGPIO               0x8C
Interrupt27  = M0_SPI_OR_DAC          0x90
Interrupt28  = M0_ADC1                0x94
Interrupt29  = M0_SSP0_OR_SSP1        0x98
Interrupt30  = M0_EVENTROUTER         0x9C
Interrupt31  = M0_USART0              0xA0
Interrupt32  = M0_UART1               0xA4
Interrupt33  = M0_USART2_OR_C_CAN1    0xA8
Interrupt34  = M0_USART3              0xAC
Interrupt35  = M0_I2S0_OR_I2S1_OR_QEI 0xB0
Interrupt36  = M0_C_CAN0              0xB4
###DDF-INTERRUPT-END###*/
